#include <stdio.h>
int main() {
	//printf("1번------------\n\n");
	//num1();

	//printf("\n\n2번------------\n\n");
	//num2();

	//printf("\n\n3번------------\n\n");
	//num3();

	//printf("\n\n4번------------\n\n");
	//num4();

	//printf("\n\n5번------------\n\n");
	//num5();

	//printf("\n\n6번------------\n\n");
	//num6();

	//printf("\n\n7번------------\n\n");
	//num7();

	//printf("\n\n8번------------\n\n");
	//num8();

	//printf("\n\n9번------------\n\n");
	//num9();

	//printf("\n\n10번------------\n\n");
	//num10();

	//printf("\n\n11번------------\n\n");
	//num11();

	//printf("\n\n12번------------\n\n");
	//num12();

	//printf("\n\n13번------------\n\n");
	//num13();

	//printf("\n\n14번------------\n\n");
	//num14();

	//printf("\n\n15번------------\n\n");
	//num15();

	//printf("\n\n16번------------\n\n");
	//num16();

	//printf("\n\n17번------------\n\n");
	//num17();

	//printf("\n\n18번------------\n\n");
	//num18();

	//printf("\n\n19번------------\n\n");
	//num19();

	//printf("\n\n20번------------\n\n");
	//num20();

	//printf("\n\n21번------------\n\n");
	//num21();

	//printf("\n\n22번------------\n\n");
	//num22();

	//printf("\n\n23번------------\n\n");
	//num23();

	//printf("\n\n24번------------\n\n");
	//num24();

	//printf("\n\n25번------------\n\n");
	//num25();

	//printf("\n\n26번------------\n\n");
	//num26();

	//printf("\n\n27번------------\n\n");
	//num27();

	//printf("\n\n28번------------\n\n");
	//num28();

	//printf("\n\n29번------------\n\n");
	//num29();

	printf("\n\n30번------------\n\n");
	num30();
}